app/controllers/fuels_controller.rb

SELECT "fuels".* FROM "fuels"
---
  def index
    @fuels = Fuel.all

INSERT INTO "fuels" ("fill_date", "mileage", "cost_per_gallon", "location", "gallons", "vehicle_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @fuel = Fuel.new(
      user_id: current_user.id,
      fill_date: params[:fill_date],
      mileage: params[:mileage],
      cost_per_gallon: params[:cost_per_gallon],
      location: params[:location],
      gallons: params[:gallons],
      vehicle_id: params[:vehicle_id],
    )
    if @fuel.save #happy path