app/controllers/users_controller.rb

INSERT INTO "users" ("email", "name", "password_digest", "created_at", "updated_at", "vehicle_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["email", "joe@example.com"], ["name", "Joe"], ["password_digest", "[FILTERED]"], ["created_at", "2023-09-07 00:57:45.085818"], ["updated_at", "2023-09-07 00:57:45.085818"], ["vehicle_id", nil]]
---
  def create
    user = User.new(
      name: params[:name],
      email: params[:email],
      password: params[:password],
      password_confirmation: params[:password_confirmation],
    )
    if user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]
---
  def destroy
    @user = User.find_by(id: params[:id])
    @user.destroy