app/controllers/vehicles_controller.rb

  def create
    @vehicle = Vehicle.new(
      year: params[:year],
      make: params[:make],
      model: params[:model],

    )
    if @vehicle.save #happy path
---
INSERT INTO "vehicles" ("year", "make", "model", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["year", 2023], ["make", "Toyota"], ["model", "4Runner"], ["created_at", "2023-09-06 16:19:20.960750"], ["updated_at", "2023-09-06 16:19:20.960750"]]