app/controllers/vehicles_controller.rb

SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def show
    @vehicle = Vehicle.find_by(id: params["id"])

INSERT INTO "vehicles" ("year", "make", "model", "created_at", "updated_at", "user_id", "image_url") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @vehicle = Vehicle.new(
      user_id: current_user.id,
      year: params[:year],
      make: params[:make],
      model: params[:model],
      image_url: params[:image_url],
    )
    if @vehicle.save #happy path

SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = $1 LIMIT $2  [["id", 29], ["LIMIT", 1]]
UPDATE "vehicles" SET "year" = $1, "make" = $2, "model" = $3, "updated_at" = $4 WHERE "vehicles"."id" = $5  [["year", 2023], ["make", "Honda"], ["model", "Accord"], ["updated_at", "2023-09-08 18:55:01.932746"], ["id", 4]]
---
  def update
    @vehicle = Vehicle.find_by(id: params[:id])
    @vehicle.update(
      # user_id: params[:vehicle]["user_id"] || @vehicle.user_id,
      make: params["make"] || @vehicle.make,
      model: params["model"] || @vehicle.model,
      year: params["year"] || @vehicle.year,
      image_url: params["image_url"] || @vehicle.image_url,
    )

SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = $1 LIMIT $2  [["id", 29], ["LIMIT", 1]]
DELETE FROM "vehicles" WHERE "vehicles"."id" = $1  [["id", 29]]
---
  def destroy
    vehicle = Vehicle.find_by(id: params["id"])
    vehicle.destroy